Autodesk.Revit.DB.SymbolTypeId.Shaku
Symbol 尺, indicating unit Shaku.
Since:
2021

Autodesk.Revit.DB.SymbolTypeId.MW
Symbol MW, indicating unit Megawatts.
Since:
2021

Autodesk.Revit.DB.SymbolTypeId.MJ
Symbol MJ, indicating unit Megajoules.
Since:
2021

Autodesk.Revit.DB.SymbolTypeId.GJ
Symbol GJ, indicating unit Gigajoules.
Since:
2021